valentin.org
** Variable fonts
   This way, I could use variable fonts for different parts of a document. Currently, it is not implemented, since I am using Hasklig for everything.
   #+BEGIN_SRC emacs-lisp
     (add-hook 'text-mode-hook 
		    (lambda ()
		     (variable-pitch-mode 1))) 
   #+END_SRC
** Font size
   This is to change font and size of every window. It is intended to be variable, if I choose to down the line. Also, there is a different version for Linuz and another one for Mac.
*** For Linux
    #+BEGIN_SRC emacs-lisp
      (if (eq system-type 'gnu/linux)
	  (set-face-attribute 'default nil
			      :family "Source Code Pro"
			      :height 150))
      (if (eq system-type 'gnu/linux)
	  (set-face-attribute 'fixed-pitch nil
			      :family "Source Code Pro"
			      :height 140))
      (if (eq system-type 'gnu/linux)
	  (set-face-attribute 'variable-pitch nil
			      :family "Source Code Pro"
			      :height 150))
    #+END_SRC
*** For Mac
    #+BEGIN_SRC emacs-lisp
      (if (eq system-type 'darwin)
	  (set-face-attribute 'default nil
			      :family "Hasklig" :height 190))
      (if (eq system-type 'darwin)
	  (set-face-attribute 'fixed-pitch nil
			      :family "Hasklig" :height 170))
      (if (eq system-type 'darwin)
	  (set-face-attribute 'variable-pitch nil
			    :family "Hasklig" :height 190))
    #+END_SRC
** Delete Highlighted text
   The normal behavior for this.
   #+BEGIN_SRC emacs-lisp
     (delete-selection-mode 1)
   #+END_SRC
** Initialize stuff
   #+BEGIN_SRC emacs-lisp
     (setq inhibit-startup-message t)

     (fset 'yes-or-no-p 'y-or-n-p)

     (global-set-key (kbd "<f5>") 'revert-buffer)
   #+END_SRC

** Theme
   A global setting to use doom theme's icons and other stuff

   #+BEGIN_SRC emacs-lisp
     (use-package doom-themes
       :ensure t
       :defer)

     (use-package doom-modeline
       :ensure t
       :defer)

     (require 'doom-modeline)

     (doom-modeline-init)
   #+END_SRC

   UPDATE: I will comment out the change according to OS. I will only use doom-peackock. In case I want to reenable circadian package in the future, I will just comment it out.

And change the color scheme according to OS. First, for linux:
   #+BEGIN_SRC emacs-lisp
     ;(if (eq system-type 'gnu/linux)
	  (load-theme 'doom-peacock t);)
   #+END_SRC

   And for Mac:
   #+BEGIN_SRC emacs-lisp
     ;(if (eq system-type 'darwin)
     ;    (use-package circadian
     ;      :ensure t
     ;      :config
     ;      (setq circadian-themes '(("8:00" . leuven)
     ;			       ("18:00" . doom-peacock)))
     ;      (circadian-setup)))
   #+END_SRC

** Ace Windows
   For easy window switching, just do =C-x o= and choose the number. It only works with more than 2 windows.
  #+BEGIN_SRC emacs-lisp
  (use-package ace-window
  :ensure t
  :init
  (progn
  (setq aw-scope 'global) ;; was frame
  (global-set-key (kbd "C-x O") 'other-frame)
    (global-set-key [remap other-window] 'ace-window)
    (custom-set-faces
     '(aw-leading-char-face
       ((t (:inherit ace-jump-face-foreground :height 3.0))))) 
    ))
  #+END_SRC
** Numbers in all buffers
   #+BEGIN_SRC emacs-lisp
     (global-linum-mode t)
   #+END_SRC
** Global text wrapping
   #+BEGIN_SRC emacs-lisp
     (global-visual-line-mode t)
   #+END_SRC
** Show and highlight parenthesis
   First, shown them
   #+BEGIN_SRC emacs-lisp
     (show-paren-mode 1)
     (setq show-paren-delay 0)
   #+END_SRC
   
   Now, be smart about them
   #+BEGIN_SRC emacs-lisp
     (use-package smartparens
       :diminish smartparens-mode
       :ensure t
       :config
       (setq
	sp-autoskip-closing-pair 'always
	sp-hybrid-kill-entire-symbol nil)
       (show-smartparens-global-mode +1)
       (smartparens-global-mode 1)
       ;; Fix usage of ' in Lisp modes
       ;; THANKS: https://github.com/Fuco1/smartparens/issues/286#issuecomment-32324743
       ;; (eval) is used as a hack to quiet Flycheck errors about (sp-with-modes)
       (eval
	'(sp-with-modes sp-lisp-modes
	   ;; disable ', it's the quote character!
	   (sp-local-pair "'" nil :actions nil)
	   ;; also only use the pseudo-quote inside strings where it serve as
	   ;; hyperlink.
	   (sp-local-pair "`" "'" :when '(sp-in-string-p sp-in-comment-p))
	   (sp-local-pair "`" nil
			  :skip-match (lambda (ms mb me)
					(cond
					 ((equal ms "'")
					  (or (sp--org-skip-markup ms mb me)
					      (not (sp-point-in-string-or-comment))))
					 (t (not (sp-point-in-string-or-comment))))))))
       ;; Don't pair { in web-mode
       (eval
	'(sp-with-modes 'web-mode
	   (sp-local-pair "\{" nil :actions nil))))
   #+END_SRC
** Remap cmd key in Mac
   #+BEGIN_SRC emacs-lisp
     ;; remap command key to meta
     (if (eq system-type 'darwin)
	 (setq mac-command-modifier 'meta))
   #+END_SRC
** Show greek letters in org mode 
   #+BEGIN_SRC emacs-lisp
     (setq org-pretty-entitles t)
   #+END_SRC

   This one is longer and if it works, it should toggle on/off whenever the cursor is in the equation(s)
   #+BEGIN_SRC emacs-lisp
     (defvar org-latex-fragment-last nil
       "Holds last fragment/environment you were on.")

     (defun org-latex-fragment-toggle ()
       "Toggle a latex fragment image "
       (and (eq 'org-mode major-mode)
	    (let* ((el (org-element-context))
		   (el-type (car el)))
	      (cond
	       ;; were on a fragment and now on a new fragment
	       ((and
		 ;; fragment we were on
		 org-latex-fragment-last
		 ;; and are on a fragment now
		 (or
		  (eq 'latex-fragment el-type)
		  (eq 'latex-environment el-type))
		 ;; but not on the last one this is a little tricky. as you edit the
		 ;; fragment, it is not equal to the last one. We use the begin
		 ;; property which is less likely to change for the comparison.
		 (not (= (org-element-property :begin el)
			 (org-element-property :begin org-latex-fragment-last))))
		;; go back to last one and put image back
		(save-excursion
		  (goto-char (org-element-property :begin org-latex-fragment-last))
		  (org-preview-latex-fragment))
		;; now remove current image
		(goto-char (org-element-property :begin el))
		(let ((ov (loop for ov in org-latex-fragment-image-overlays
				if
				(and
				 (<= (overlay-start ov) (point))
				 (>= (overlay-end ov) (point)))
				return ov)))
		  (when ov
		    (delete-overlay ov)))
		;; and save new fragment
		(setq org-latex-fragment-last el))

	       ;; were on a fragment and now are not on a fragment
	       ((and
		 ;; not on a fragment now
		 (not (or
		       (eq 'latex-fragment el-type)
		       (eq 'latex-environment el-type)))
		 ;; but we were on one
		 org-latex-fragment-last)
		;; put image back on
		(save-excursion
		  (goto-char (org-element-property :begin org-latex-fragment-last))
		  (org-preview-latex-fragment))
		;; unset last fragment
		(setq org-latex-fragment-last nil))

	       ;; were not on a fragment, and now are
	       ((and
		 ;; we were not one one
		 (not org-latex-fragment-last)
		 ;; but now we are
		 (or
		  (eq 'latex-fragment el-type)
		  (eq 'latex-environment el-type)))
		(goto-char (org-element-property :begin el))
		;; remove image
		(let ((ov (loop for ov in org-latex-fragment-image-overlays
				if
				(and
				 (<= (overlay-start ov) (point))
				 (>= (overlay-end ov) (point)))
				return ov)))
		  (when ov
		    (delete-overlay ov)))
		(setq org-latex-fragment-last el))))))


     (add-hook 'post-command-hook 'org-latex-fragment-toggle)
   #+END_SRC
* Org Mode
