valentin.el

;; [[file:~/.emacs.d/valentin.org::*Variable%20fonts][Variable fonts:1]]
(add-hook 'text-mode-hook 
	       (lambda ()
		(variable-pitch-mode 1)))
;; Variable fonts:1 ends here

;; [[file:~/.emacs.d/valentin.org::*For%20Linux][For Linux:1]]
(if (eq system-type 'gnu/linux)
    (set-face-attribute 'default nil
			:family "Source Code Pro"
			:height 150))
(if (eq system-type 'gnu/linux)
    (set-face-attribute 'fixed-pitch nil
			:family "Source Code Pro"
			:height 140))
(if (eq system-type 'gnu/linux)
    (set-face-attribute 'variable-pitch nil
			:family "Source Code Pro"
			:height 150))
;; For Linux:1 ends here

;; [[file:~/.emacs.d/valentin.org::*For%20Mac][For Mac:1]]
(if (eq system-type 'darwin)
    (set-face-attribute 'default nil
			:family "Hasklig" :height 190))
(if (eq system-type 'darwin)
    (set-face-attribute 'fixed-pitch nil
			:family "Hasklig" :height 170))
(if (eq system-type 'darwin)
    (set-face-attribute 'variable-pitch nil
		      :family "Hasklig" :height 190))
;; For Mac:1 ends here

;; [[file:~/.emacs.d/valentin.org::*Delete%20Highlighted%20text][Delete Highlighted text:1]]
(delete-selection-mode 1)
;; Delete Highlighted text:1 ends here

;; [[file:~/.emacs.d/valentin.org::*Initialize%20stuff][Initialize stuff:1]]
(setq inhibit-startup-message t)

(fset 'yes-or-no-p 'y-or-n-p)

(global-set-key (kbd "<f5>") 'revert-buffer)
;; Initialize stuff:1 ends here

;; [[file:~/.emacs.d/valentin.org::*Theme][Theme:1]]
(use-package doom-themes
  :ensure t
  :defer)

(use-package doom-modeline
  :ensure t
  :defer)

(require 'doom-modeline)

(doom-modeline-init)
;; Theme:1 ends here

;; [[file:~/.emacs.d/valentin.org::*Theme][Theme:2]]
;(if (eq system-type 'gnu/linux)
     (load-theme 'doom-peacock t);)
;; Theme:2 ends here

;; [[file:~/.emacs.d/valentin.org::*Theme][Theme:3]]
;(if (eq system-type 'darwin)
;    (use-package circadian
;      :ensure t
;      :config
;      (setq circadian-themes '(("8:00" . leuven)
;			       ("18:00" . doom-peacock)))
;      (circadian-setup)))
;; Theme:3 ends here

;; [[file:~/.emacs.d/valentin.org::*Ace%20Windows][Ace Windows:1]]
(use-package ace-window
:ensure t
:init
(progn
(setq aw-scope 'global) ;; was frame
(global-set-key (kbd "C-x O") 'other-frame)
  (global-set-key [remap other-window] 'ace-window)
  (custom-set-faces
   '(aw-leading-char-face
     ((t (:inherit ace-jump-face-foreground :height 3.0))))) 
  ))
;; Ace Windows:1 ends here

;; [[file:~/.emacs.d/valentin.org::*Numbers%20in%20all%20buffers][Numbers in all buffers:1]]
(global-linum-mode t)

					; nice formatting for numbers
(setq linum-format "%4d \u2502 ")
;; Numbers in all buffers:1 ends here

;; [[file:~/.emacs.d/valentin.org::*Global%20text%20wrapping][Global text wrapping:1]]
(global-visual-line-mode t)
;; Global text wrapping:1 ends here

;; [[file:~/.emacs.d/valentin.org::*Show%20and%20highlight%20parenthesis][Show and highlight parenthesis:1]]
(show-paren-mode 1)
(setq show-paren-delay 0)
;; Show and highlight parenthesis:1 ends here

;; [[file:~/.emacs.d/valentin.org::*Show%20and%20highlight%20parenthesis][Show and highlight parenthesis:2]]
(use-package smartparens
  :diminish smartparens-mode
  :ensure t
  :config
  (setq
   sp-autoskip-closing-pair 'always
   sp-hybrid-kill-entire-symbol nil)
  (show-smartparens-global-mode +1)
  (smartparens-global-mode 1)
  ;; Fix usage of ' in Lisp modes
  ;; THANKS: https://github.com/Fuco1/smartparens/issues/286#issuecomment-32324743
  ;; (eval) is used as a hack to quiet Flycheck errors about (sp-with-modes)
  (eval
   '(sp-with-modes sp-lisp-modes
      ;; disable ', it's the quote character!
      (sp-local-pair "'" nil :actions nil)
      ;; also only use the pseudo-quote inside strings where it serve as
      ;; hyperlink.
      (sp-local-pair "`" "'" :when '(sp-in-string-p sp-in-comment-p))
      (sp-local-pair "`" nil
		     :skip-match (lambda (ms mb me)
				   (cond
				    ((equal ms "'")
				     (or (sp--org-skip-markup ms mb me)
					 (not (sp-point-in-string-or-comment))))
				    (t (not (sp-point-in-string-or-comment))))))))
  ;; Don't pair { in web-mode
  (eval
   '(sp-with-modes 'web-mode
      (sp-local-pair "\{" nil :actions nil))))
;; Show and highlight parenthesis:2 ends here

;; [[file:~/.emacs.d/valentin.org::*Remap%20cmd%20key%20in%20Mac][Remap cmd key in Mac:1]]
;; remap command key to meta
(if (eq system-type 'darwin)
    (setq mac-command-modifier 'meta))
;; Remap cmd key in Mac:1 ends here

;; [[file:~/.emacs.d/valentin.org::*Show%20greek%20letters%20in%20org%20mode][Show greek letters in org mode:1]]
(setq org-pretty-entitles t)
;; Show greek letters in org mode:1 ends here

;; [[file:~/.emacs.d/valentin.org::*Show%20greek%20letters%20in%20org%20mode][Show greek letters in org mode:2]]
(defvar org-latex-fragment-last nil
  "Holds last fragment/environment you were on.")

(defun org-latex-fragment-toggle ()
  "Toggle a latex fragment image "
  (and (eq 'org-mode major-mode)
       (let* ((el (org-element-context))
	      (el-type (car el)))
	 (cond
	  ;; were on a fragment and now on a new fragment
	  ((and
	    ;; fragment we were on
	    org-latex-fragment-last
	    ;; and are on a fragment now
	    (or
	     (eq 'latex-fragment el-type)
	     (eq 'latex-environment el-type))
	    ;; but not on the last one this is a little tricky. as you edit the
	    ;; fragment, it is not equal to the last one. We use the begin
	    ;; property which is less likely to change for the comparison.
	    (not (= (org-element-property :begin el)
		    (org-element-property :begin org-latex-fragment-last))))
	   ;; go back to last one and put image back
	   (save-excursion
	     (goto-char (org-element-property :begin org-latex-fragment-last))
	     (org-preview-latex-fragment))
	   ;; now remove current image
	   (goto-char (org-element-property :begin el))
	   (let ((ov (loop for ov in org-latex-fragment-image-overlays
			   if
			   (and
			    (<= (overlay-start ov) (point))
			    (>= (overlay-end ov) (point)))
			   return ov)))
	     (when ov
	       (delete-overlay ov)))
	   ;; and save new fragment
	   (setq org-latex-fragment-last el))

	  ;; were on a fragment and now are not on a fragment
	  ((and
	    ;; not on a fragment now
	    (not (or
		  (eq 'latex-fragment el-type)
		  (eq 'latex-environment el-type)))
	    ;; but we were on one
	    org-latex-fragment-last)
	   ;; put image back on
	   (save-excursion
	     (goto-char (org-element-property :begin org-latex-fragment-last))
	     (org-preview-latex-fragment))
	   ;; unset last fragment
	   (setq org-latex-fragment-last nil))

	  ;; were not on a fragment, and now are
	  ((and
	    ;; we were not one one
	    (not org-latex-fragment-last)
	    ;; but now we are
	    (or
	     (eq 'latex-fragment el-type)
	     (eq 'latex-environment el-type)))
	   (goto-char (org-element-property :begin el))
	   ;; remove image
	   (let ((ov (loop for ov in org-latex-fragment-image-overlays
			   if
			   (and
			    (<= (overlay-start ov) (point))
			    (>= (overlay-end ov) (point)))
			   return ov)))
	     (when ov
	       (delete-overlay ov)))
	   (setq org-latex-fragment-last el))))))


(add-hook 'post-command-hook 'org-latex-fragment-toggle)
;; Show greek letters in org mode:2 ends here

;; [[file:~/.emacs.d/valentin.org::*Basic%20org][Basic org:1]]
(use-package org 
  :ensure t
  :pin org
  :config
