valentin.org
** Basic org 
   #+BEGIN_SRC emacs-lisp
     (use-package org 
       :ensure t
       :pin org
       :config
       ;; Syntax highlight in #+BEGIN_SRC blocks
       (setq org-src-fontify-natively t)
       ;; Don't prompt before running code in org
       (setq org-confirm-babel-evaluate nil))

     (use-package org-babel-eval-in-repl
       :ensure t)


   #+END_SRC
   
This is only for Mac 
   #+BEGIN_SRC emacs-lisp
     (use-package exec-path-from-shell
       :init
       (setq exec-path-from-shell-check-startup-files nil)
       (if (eq system-type 'darwin)
	 (exec-path-from-shell-initialize)))
   #+END_SRC

With this, I make sure that my opened files (after compilation are opened in evince)
#+BEGIN_SRC emacs-lisp
  (if (eq system-type 'gnu/linux)
      ;; PDFs visited in Org-mode are opened in Evince (and not in the default choice)
      (eval-after-load "org"
	'(progn
       ;; Change .pdf association directly within the alist
	   (setcdr (assoc "\\.pdf\\'" org-file-apps) "evince %s"))))
#+END_SRC
** Org Bullets
   #+BEGIN_SRC emacs-lisp
     (use-package org-bullets
       :ensure t
       :config
       (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))))
   #+END_SRC

** Management of references
   This will enable org-ref. It is required to have a file with the citations. It works with =.bib= files.
   #+BEGIN_SRC emacs-lisp
     (use-package org-ref
       :after org
       :init
       (setq org-ref-default-bibliography '("~/Dropbox/galactica.bib"))
       ;; Next line is to change the search buffer from helm to ivy (prefer helm, if it works)
       (setq org-ref-completion-library 'org-ref-ivy-cite)
       (setq bibtex-completion-bibliography org-ref-default-bibliography))

     (use-package doi-utils
       :after org)

     (use-package org-ref-bibtex
       :after org)

   #+END_SRC
** Reveal.js for presentations in html
   #+BEGIN_SRC emacs-lisp
     (use-package org-re-reveal
       :ensure t
       :config
       (require 'ox-re-reveal)
       ;(setq org-re-reveal-root "http://cdn.jsdelivr.net/reveal.js/3.0.0/")
       (setq org-re-reveal-root "https://revealjs.com/")
       (setq org-re-reveal-mathjax t)
       (setq org-re-reveal-highlight-css t)
     )

     (use-package htmlize
       :ensure t)
  #+END_SRC

** Support for ipython and jupyter notebooks
   #+BEGIN_SRC emacs-lisp
     ;; Ipython
     (use-package ob-ipython
       :ensure t)
     (require 'ob-ipython)

     ;; Jupyter notebooks
     (use-package ein
       :ensure t)
     (require 'ein)

     (setq org-babel-python-command "python3")

     (custom-set-variables
      '(flycheck-python-flake8-executable "python3")
      '(flycheck-python-pycompile-executable "python3")
      '(flycheck-python-pylint-executable "python3"))
   #+END_SRC
** Exporting to LaTeX
   This is to produce a pdf without using shell. Let's see if it works
   #+BEGIN_SRC emacs-lisp
     (setq org-latex-pdf-process
	   '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
	     "bibtex %b"
	     "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
	     "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))
   #+END_SRC
   
   And this is for minted listings
   #+BEGIN_SRC emacs-lisp
     (setq org-latex-listings t)
     (setq org-latex-listings 'minted)
     (setq org-latex-minted-options
		'(("frame" "lines")
		  ;("fontsize" "\\scriptsize")
		  ("numbers" "both")
		  ("mathescape")
		  ("breaklines" "true")
		  ("breakanywhere" "true")
		  ("style" "tango")))
   #+END_SRC

I will use the following code to make the /exam/ class recognizable by org export 
#+BEGIN_SRC emacs-lisp
  (add-to-list 'org-latex-classes
	'("exam"
	   "\\documentclass{exam}
	   [NO-DEFAULT-PACKAGES]
	   [PACKAGES]
	   [EXTRA]"
	   ("\\section{%s}" . "\\section*{%s}")
	   ("\\subsection{%s}" . "\\subsection*{%s}")
	   ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
	   ("\\paragraph{%s}" . "\\paragraph*{%s}")
	   ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
#+END_SRC

Nothing in =hypersetup=
#+BEGIN_SRC emacs-lisp
  (setq org-latex-with-hyperref nil)
#+END_SRC

** CV in org 
   #+BEGIN_SRC emacs-lisp
     (use-package ox-moderncv
	 :load-path "~/.emacs.d/org-cv/"
	 :init (require 'ox-moderncv))
   #+END_SRC
** Literate programming (ipython)
   #+BEGIN_SRC emacs-lisp
     (require 'ob-ipython)
   #+END_SRC
** Load all the languages in org 
   #+BEGIN_SRC emacs-lisp
     (org-babel-do-load-languages
      'org-babel-load-languages
      '((emacs-lisp . t)
	(python . t)
	(latex . t)
	(R . t)
	(ein . t)
	(css . t)
	(matlab . t)
	(octave . t)
	(shell . t)
	(ipython . t)
	(fortran . t)
	(gnuplot . t)
	(java . t)
	(C . t)))
   #+END_SRC
    And then, some misc stuff
    #+BEGIN_SRC emacs-lisp
     ;; to use R kernel on ein chunks
      (ein:org-register-lang-mode "ein-R" 'R)
    #+END_SRC
** Source blocks are not indented (mostly for python)
#+BEGIN_SRC emacs-lisp
  (setq org-src-preserve-indentation nil 
	org-edit-src-content-indentation 0)
#+END_SRC
* Python
** Elpy (should do most of the work)
   #+BEGIN_SRC emacs-lisp
     (use-package elpy
       :ensure t
       :init 
       (elpy-enable))
   #+END_SRC
** Flycheck for autocompletion
   #+BEGIN_SRC emacs-lisp
   (use-package flycheck
     :ensure t
     :init
     (global-flycheck-mode t))
  #+END_SRC

** Some other stuff to use Python 3
Here are some general stuff to change the default interpreter to version 3
   #+BEGIN_SRC emacs-lisp
     (setq python-shell-interpreter "python3")
     (setq python-shell-interpreter-args "-m IPython --simple-prompt -i")
     (setq flycheck-python-pycompile-executable "python3")
   #+END_SRC

And some more stuff to make it compatible with doom-themes.
   #+BEGIN_SRC emacs-lisp
     (defvar doom-modeline-python-executable "python"
       "What executable of Python will be used (if nil nothing will be showed).")

     (setq doom-modeline-python-executable "python3")
     (setq python-shell-interpreter "python3")
     (setq python-shell-interpreter-args "-m IPython --simple-prompt -i")
     (setq flycheck-python-pycompile-executable "python3"
	   flycheck-python-pylint-executable "python3"
	   flycheck-python-flake8-executable "python3")
     (setq doom-modeline-major-mode-icon nil
	   doom-modeline-persp-name t
	   doom-modeline-github t
	   doom-modeline-version t
	   doom-modeline-minor-modes t)
     ;(minions-mode 1)
     ;(setq persp-nil-name "#")
     ;(setq minions-mode-line-lighter "◎")

     (with-eval-after-load 'python
       (defun python-shell-completion-native-try ()
	 "Return non-nil if can trigger native completion."
	 (let ((python-shell-completion-native-enable t)
	       (python-shell-completion-native-output-timeout
		python-shell-completion-native-try-output-timeout))
	   (python-shell-completion-native-get-completions
	    (get-buffer-process (current-buffer))
	    nil "_"))))

     (setq python-shell-completion-native-disabled-interpreters '("python"))
   #+END_SRC

* LaTeX 
  #+BEGIN_SRC emacs-lisp
    (if (eq system-type 'darwin)
	(use-package auctex
	  :ensure t
	  :mode ("\\.tex\\'" . latex-mode)
	  :commands (latex-mode LaTeX-mode plain-tex-mode)
	  :init
	  (progn
	    (add-hook 'LaTeX-mode-hook #'LaTeX-preview-setup)
	    (add-hook 'LaTeX-mode-hook 'LaTeX-math-mode)
	    (add-hook 'LaTeX-mode-hook #'flyspell-mode)
	    (add-hook 'LaTeX-mode-hook #'turn-on-reftex)
	    (setq TeX-auto-save t
		  TeX-parse-self t
		  TeX-save-query nil
		  TeX-PDF-mode t)
	)))
  #+END_SRC
* R (in ESS)
