valentin.el
  ;; Syntax highlight in #+BEGIN_SRC blocks
  (setq org-src-fontify-natively t)
  ;; Don't prompt before running code in org
  (setq org-confirm-babel-evaluate nil))

(use-package org-babel-eval-in-repl
  :ensure t)
;; Basic org:1 ends here

;; [[file:~/.emacs.d/valentin.org::*Basic%20org][Basic org:2]]
(use-package exec-path-from-shell
  :init
  (setq exec-path-from-shell-check-startup-files nil)
  (if (eq system-type 'darwin)
    (exec-path-from-shell-initialize)))
;; Basic org:2 ends here

;; [[file:~/.emacs.d/valentin.org::*Basic%20org][Basic org:3]]
(if (eq system-type 'gnu/linux)
    ;; PDFs visited in Org-mode are opened in Evince (and not in the default choice)
    (eval-after-load "org"
      '(progn
     ;; Change .pdf association directly within the alist
	 (setcdr (assoc "\\.pdf\\'" org-file-apps) "evince %s"))))
;; Basic org:3 ends here

;; [[file:~/.emacs.d/valentin.org::*Org%20Bullets][Org Bullets:1]]
(use-package org-bullets
  :ensure t
  :config
  (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))))
;; Org Bullets:1 ends here

;; [[file:~/.emacs.d/valentin.org::*Management%20of%20references][Management of references:1]]
(use-package org-ref
  :after org
  :init
  (setq org-ref-default-bibliography '("~/Dropbox/galactica.bib"))
  ;; Next line is to change the search buffer from helm to ivy (prefer helm, if it works)
  (setq org-ref-completion-library 'org-ref-ivy-cite)
  (setq bibtex-completion-bibliography org-ref-default-bibliography))

(use-package doi-utils
  :after org)

(use-package org-ref-bibtex
  :after org)
;; Management of references:1 ends here

;; [[file:~/.emacs.d/valentin.org::*Reveal.js%20for%20presentations%20in%20html][Reveal.js for presentations in html:1]]
(use-package org-re-reveal
  :ensure t
  :config
  (require 'ox-re-reveal)
  ;(setq org-re-reveal-root "http://cdn.jsdelivr.net/reveal.js/3.0.0/")
  (setq org-re-reveal-root "https://revealjs.com/")
  (setq org-re-reveal-mathjax t)
  (setq org-re-reveal-highlight-css t)
)

(use-package htmlize
  :ensure t)
;; Reveal.js for presentations in html:1 ends here

;; [[file:~/.emacs.d/valentin.org::*Support%20for%20ipython%20and%20jupyter%20notebooks][Support for ipython and jupyter notebooks:1]]
;; Ipython
(use-package ob-ipython
  :ensure t)
(require 'ob-ipython)

;; Jupyter notebooks
(use-package ein
  :ensure t)
(require 'ein)

(setq org-babel-python-command "python3")

(custom-set-variables
 '(flycheck-python-flake8-executable "python3")
 '(flycheck-python-pycompile-executable "python3")
 '(flycheck-python-pylint-executable "python3"))
;; Support for ipython and jupyter notebooks:1 ends here

;; [[file:~/.emacs.d/valentin.org::*Exporting%20to%20LaTeX][Exporting to LaTeX:1]]
(setq org-latex-pdf-process
      '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
	"bibtex %b"
	"pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
	"pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))
;; Exporting to LaTeX:1 ends here

;; [[file:~/.emacs.d/valentin.org::*Exporting%20to%20LaTeX][Exporting to LaTeX:2]]
(setq org-latex-listings t)
(setq org-latex-listings 'minted)
(setq org-latex-minted-options
	   '(("frame" "lines")
	     ;("fontsize" "\\scriptsize")
	     ("numbers" "both")
	     ("mathescape")
	     ("breaklines" "true")
	     ("breakanywhere" "true")
	     ("style" "tango")))
;; Exporting to LaTeX:2 ends here

;; [[file:~/.emacs.d/valentin.org::*Exporting%20to%20LaTeX][Exporting to LaTeX:3]]
(add-to-list 'org-latex-classes
      '("exam"
	 "\\documentclass{exam}
	 [NO-DEFAULT-PACKAGES]
	 [PACKAGES]
	 [EXTRA]"
	 ("\\section{%s}" . "\\section*{%s}")
	 ("\\subsection{%s}" . "\\subsection*{%s}")
	 ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
	 ("\\paragraph{%s}" . "\\paragraph*{%s}")
	 ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
;; Exporting to LaTeX:3 ends here

;; [[file:~/.emacs.d/valentin.org::*Exporting%20to%20LaTeX][Exporting to LaTeX:4]]
(setq org-latex-with-hyperref nil)
;; Exporting to LaTeX:4 ends here

;; [[file:~/.emacs.d/valentin.org::*CV%20in%20org][CV in org:1]]
(use-package ox-moderncv
    :load-path "~/.emacs.d/org-cv/"
    :init (require 'ox-moderncv))
;; CV in org:1 ends here

;; [[file:~/.emacs.d/valentin.org::*Literate%20programming%20(ipython)][Literate programming (ipython):1]]
(require 'ob-ipython)
;; Literate programming (ipython):1 ends here

;; [[file:~/.emacs.d/valentin.org::*Load%20all%20the%20languages%20in%20org][Load all the languages in org:1]]
(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
   (python . t)
   (latex . t)
   (R . t)
   (ein . t)
   (css . t)
   (matlab . t)
   (octave . t)
   (shell . t)
   (ipython . t)
   (fortran . t)
   (gnuplot . t)
   (java . t)
   (C . t)))
;; Load all the languages in org:1 ends here

;; [[file:~/.emacs.d/valentin.org::*Load%20all%20the%20languages%20in%20org][Load all the languages in org:2]]
;; to use R kernel on ein chunks
 (ein:org-register-lang-mode "ein-R" 'R)
;; Load all the languages in org:2 ends here

;; [[file:~/.emacs.d/valentin.org::*Source%20blocks%20are%20not%20indented%20(mostly%20for%20python)][Source blocks are not indented (mostly for python):1]]
(setq org-src-preserve-indentation nil 
      org-edit-src-content-indentation 0)
;; Source blocks are not indented (mostly for python):1 ends here

;; [[file:~/.emacs.d/valentin.org::*Elpy%20(should%20do%20most%20of%20the%20work)][Elpy (should do most of the work):1]]
(use-package elpy
  :ensure t
  :init 
  (elpy-enable))

(setq elpy-rpc-python-command "python3")

(setq python-shell-interpreter "python3"
      python-shell-interpreter-args "-i")
;; Elpy (should do most of the work):1 ends here

;; [[file:~/.emacs.d/valentin.org::*Flycheck%20for%20autocompletion][Flycheck for autocompletion:1]]
(use-package flycheck
  :ensure t
  :init
  (global-flycheck-mode t))
;; Flycheck for autocompletion:1 ends here

;; [[file:~/.emacs.d/valentin.org::*Some%20other%20stuff%20to%20use%20Python%203][Some other stuff to use Python 3:1]]
(setq python-shell-interpreter "python3")
(setq python-shell-interpreter-args "-m IPython --simple-prompt -i")
(setq flycheck-python-pycompile-executable "python3")
;; Some other stuff to use Python 3:1 ends here

;; [[file:~/.emacs.d/valentin.org::*Some%20other%20stuff%20to%20use%20Python%203][Some other stuff to use Python 3:2]]
(defvar doom-modeline-python-executable "python"
  "What executable of Python will be used (if nil nothing will be showed).")

(setq doom-modeline-python-executable "python3")
(setq python-shell-interpreter "python3")
(setq python-shell-interpreter-args "-m IPython --simple-prompt -i")
(setq flycheck-python-pycompile-executable "python3"
      flycheck-python-pylint-executable "python3"
      flycheck-python-flake8-executable "python3")
(setq doom-modeline-major-mode-icon nil
      doom-modeline-persp-name t
      doom-modeline-github t
      doom-modeline-version t
      doom-modeline-minor-modes t)
;(minions-mode 1)
;(setq persp-nil-name "#")
;(setq minions-mode-line-lighter "◎")

(with-eval-after-load 'python
  (defun python-shell-completion-native-try ()
    "Return non-nil if can trigger native completion."
    (let ((python-shell-completion-native-enable t)
	  (python-shell-completion-native-output-timeout
	   python-shell-completion-native-try-output-timeout))
      (python-shell-completion-native-get-completions
       (get-buffer-process (current-buffer))
       nil "_"))))

(setq python-shell-completion-native-disabled-interpreters '("python"))
;; Some other stuff to use Python 3:2 ends here

;; [[file:~/.emacs.d/valentin.org::*LaTeX][LaTeX:1]]
(if (eq system-type 'darwin)
    (use-package auctex
      :ensure t
      :mode ("\\.tex\\'" . latex-mode)
      :commands (latex-mode LaTeX-mode plain-tex-mode)
      :init
      (progn
	(add-hook 'LaTeX-mode-hook #'LaTeX-preview-setup)
	(add-hook 'LaTeX-mode-hook 'LaTeX-math-mode)
	(add-hook 'LaTeX-mode-hook #'flyspell-mode)
	(add-hook 'LaTeX-mode-hook #'turn-on-reftex)
	(setq TeX-auto-save t
	      TeX-parse-self t
	      TeX-save-query nil
	      TeX-PDF-mode t)
    )))
;; LaTeX:1 ends here
