valentin.org
** Only for R stuff
   #+BEGIN_SRC emacs-lisp
     (use-package ess-site
       :ensure ess
       :demand t
       :if
       (eq system-type 'darwin)
       :config
       ;; Don't hog Emacs when submitting long-running code
       (setq ess-eval-visibly 'nowait))
   #+END_SRC
* Magit 
  This is a git /interface/ to help with the git workflow.
  #+BEGIN_SRC emacs-lisp
    (use-package magit
      :ensure t
      :init
      (progn
      (bind-key "C-x g" 'magit-status)
      ))

  #+END_SRC
* Fortran
This stuff is for testing purposes. I'm trying to get Fortran running on my computers. 

#+BEGIN_SRC emacs-lisp
  (autoload 'f90-mode "f90" "Fortran 90 mode" t)
  (add-hook 'f90-mode-hook 'my-f90-mode-hook)

  (defun my-f90-mode-hook ()
    (setq f90-font-lock-keywords f90-font-lock-keywords-3)
    (abbrev-mode 1)                       ; turn on abbreviation mode
    (turn-on-font-lock)                   ; syntax highlighting
    (auto-fill-mode 0))                   ; turn off auto-filling
#+END_SRC
* Misc Packages
** How long did Emacs take to load?
   #+BEGIN_SRC emacs-lisp
     (defconst emacs-start-time (current-time))

     (let ((elapsed (float-time (time-subtract (current-time)
					       emacs-start-time))))
       (message "[STARTUP] Loading %s ... done (%.3fs)" load-file-name elapsed))
   #+END_SRC











   
