valentin.el

;; [[file:~/.emacs.d/valentin.org::*Only%20for%20R%20stuff][Only for R stuff:1]]
(use-package ess-site
  :ensure ess
  :demand t
  :if
  (eq system-type 'darwin)
  :config
  ;; Don't hog Emacs when submitting long-running code
  (setq ess-eval-visibly 'nowait))
;; Only for R stuff:1 ends here

;; [[file:~/.emacs.d/valentin.org::*Magit][Magit:1]]
(use-package magit
  :ensure t
  :init
  (progn
  (bind-key "C-x g" 'magit-status)
  ))
;; Magit:1 ends here

;; [[file:~/.emacs.d/valentin.org::*Fortran][Fortran:1]]
(autoload 'f90-mode "f90" "Fortran 90 mode" t)
(add-hook 'f90-mode-hook 'my-f90-mode-hook)

(defun my-f90-mode-hook ()
  (setq f90-font-lock-keywords f90-font-lock-keywords-3)
  (abbrev-mode 1)                       ; turn on abbreviation mode
  (turn-on-font-lock)                   ; syntax highlighting
  (auto-fill-mode 0))                   ; turn off auto-filling
;; Fortran:1 ends here

;; [[file:~/.emacs.d/valentin.org::*How%20long%20did%20Emacs%20take%20to%20load?][How long did Emacs take to load?:1]]
(defconst emacs-start-time (current-time))

(let ((elapsed (float-time (time-subtract (current-time)
					  emacs-start-time))))
  (message "[STARTUP] Loading %s ... done (%.3fs)" load-file-name elapsed))
;; How long did Emacs take to load?:1 ends here
